In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'sales': [100, 120, 130, 90, 80, 110, 150]
})

In [3]:
df['sales_avg'] = df['sales'].rolling(window = 3).mean()

In [4]:
df['sales_sum'] = df['sales'].rolling(window = 3).sum()

In [5]:
df

   sales   sales_avg  sales_sum
0    100         NaN        NaN
1    120         NaN        NaN
2    130  116.666667      350.0
3     90  113.333333      340.0
4     80  100.000000      300.0
5    110   93.333333      280.0
6    150  113.333333      340.0

In [6]:
df['rolling_avg'] = df['sales'].rolling(window = 3, min_periods=2).mean()

In [8]:
df['date'] = ['2012-07-21',	'2012-01-21','2012-11-21','2012-04-21','2012-09-21','20012-02-21','2012-03-21']

In [9]:
df_new = df.set_index(df['date'],inplace = True)

In [11]:
df.drop(columns = 'date',errors = 'ignore',inplace = True)

In [22]:
df

             sales   sales_avg  sales_sum  rolling_avg
date
20012-02-21    110   93.333333      280.0    93.333333
2012-01-21     120         NaN        NaN   110.000000
2012-03-21     150  113.333333      340.0   113.333333
2012-04-21      90  113.333333      340.0   113.333333
2012-07-21     100         NaN        NaN          NaN
2012-09-21      80  100.000000      300.0   100.000000
2012-11-21     130  116.666667      350.0   116.666667

In [15]:
df = df.sort_values(by = 'sales',ascending = True)

In [13]:
df['3_day_avg'] = df['sales'].rolling(window=3).mean()

In [14]:
df

             sales   sales_avg  sales_sum  rolling_avg   3_day_avg
date
2012-07-21     100         NaN        NaN          NaN         NaN
2012-01-21     120         NaN        NaN   110.000000         NaN
2012-11-21     130  116.666667      350.0   116.666667  116.666667
2012-04-21      90  113.333333      340.0   113.333333  113.333333
2012-09-21      80  100.000000      300.0   100.000000  100.000000
20012-02-21    110   93.333333      280.0    93.333333   93.333333
2012-03-21     150  113.333333      340.0   113.333333  113.333333